# Pandas Library

Install Library

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (2.2.0)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.4)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

Import Library

import pandas as pd
import numpy as np

# Series DataType

In [3]:
X = [12,3,4,5,6,7]
idx = ["A","B", "C", "D", "E", "F"]

Var = pd.Series(X, index = idx, dtype = 'float')
print(Var)

A    12.0
B     3.0
C     4.0
D     5.0
E     6.0
F     7.0
dtype: float64

In [4]:
Var

A    12.0
B     3.0
C     4.0
D     5.0
E     6.0
F     7.0
dtype: float64

In [5]:
print(Var["A"])
print(Var["F"])

12.0
7.0

In [6]:
print(Var.iloc[4])
print(Var.iloc[5])

6.0
7.0

In [7]:
print(Var[1])
print(Var[3])

3.0
5.0

C:\Users\Dell\AppData\Local\Temp\ipykernel_3816\3367895016.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(Var[1])
C:\Users\Dell\AppData\Local\Temp\ipykernel_3816\3367895016.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(Var[3])

# Functions

In [8]:
Var.index

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [9]:
Var.values

array([12.,  3.,  4.,  5.,  6.,  7.])

In [10]:
Var.head(3)

A    12.0
B     3.0
C     4.0
dtype: float64

In [11]:
Var.tail(3)

D    5.0
E    6.0
F    7.0
dtype: float64

In [12]:
Var.sort_values()

B     3.0
C     4.0
D     5.0
E     6.0
F     7.0
A    12.0
dtype: float64

# ConCanet 2 Series

In [13]:
Ser1 = [10,10,10,10,10]
Ser2 = [12,23,34,45,56]

S1 = pd.Series(Ser1, index= [1,2,3,4,5])
S2 = pd.Series(Ser2, index= [1,2,3,4,5])
print(S1+S2)

1    22
2    33
3    44
4    55
5    66
dtype: int64

In [14]:
Ser1 = [10,10,10]
Ser2 = [12,23,34]

S1 = pd.Series(Ser1, index= [1,2,3])
S2 = pd.Series(Ser2, index= [1,2,2])
print(S1+S2)

1    22.0
2    33.0
2    44.0
3     NaN
dtype: float64

# DataFrame DataType

In [15]:
Dt = [12,34,45,56,67,78]
var = pd.DataFrame(Dt)
var

    0
0  12
1  34
2  45
3  56
4  67
5  78

In [16]:
Data = {"A": [1,2,3,4], "B":[23,34,45,56], "C":[123,134,456,876]}
Var1 = pd.DataFrame(Data)
Var1

   A   B    C
0  1  23  123
1  2  34  134
2  3  45  456
3  4  56  876

In [17]:
Data = {"A": [1,2,3,4], "B":[23,34,45,56], "C":[123,134,456,876]}
Var2 = pd.DataFrame(Data, columns= ["A","C","B"])
Var2

   A    C   B
0  1  123  23
1  2  134  34
2  3  456  45
3  4  876  56

# Control Indexing

In [18]:
Data = {"A": [1,2,3,4], "B":[23,34,45,56], "C":[123,134,456,876]}
Var3 = pd.DataFrame(Data, index=["a","b","c","d"])
Var3

   A   B    C
a  1  23  123
b  2  34  134
c  3  45  456
d  4  56  876

In [19]:
Data = {"A": [1,2,3,4], "B":[23,34,45,56], "C":[123,134,456,876]}
Var3 = pd.DataFrame(Data, index=["a","b","c","d"])
print(Data["B"][3])

56

# Arithmetic Operations

In [20]:
Var = pd.DataFrame({"A": [1,2,3,4,5], "B": [5,6,7,8,9]})
Var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8
4  5  9

In [21]:
print(Var["A"] + Var["B"])

0     6
1     8
2    10
3    12
4    14
dtype: int64

# Data Inserting

In [22]:
Var = pd.DataFrame({"A": [1,2,3,4,5], "B": [5,6,7,8,9]})
Var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8
4  5  9

In [23]:
# 1-Way Data Insert

Var = pd.DataFrame({"A": [1,2,3,4,5], "B": [5,6,7,8,9]})
Var.insert(1,"col1", Var["A"])
Var

   A  col1  B
0  1     1  5
1  2     2  6
2  3     3  7
3  4     4  8
4  5     5  9

In [24]:
# 2-Way Data Insert

Var = pd.DataFrame({"A": [1,2,3,4,5], "B": [5,6,7,8,9]})
Var.insert(1,"col2", [11,22,33,44,55])
Var

   A  col2  B
0  1    11  5
1  2    22  6
2  3    33  7
3  4    44  8
4  5    55  9

# Delete Data

In [25]:
df = pd.DataFrame({"A": [12,23,4,5,6], "B": [32,34,56,78,11]})
df

    A   B
0  12  32
1  23  34
2   4  56
3   5  78
4   6  11

In [26]:
df.pop("A")
df

    B
0  32
1  34
2  56
3  78
4  11

In [27]:
del df["B"]
df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

# Create CSV Files

In [28]:
dis = pd.DataFrame({"A": [11,22,33,44,55], "B": [123,234,345,456,567]})
dis

    A    B
0  11  123
1  22  234
2  33  345
3  44  456
4  55  567

In [29]:
dis.to_csv("MyfileName", index = False)

# Read CSV Files Using Pandas

In [30]:
Files = pd.read_csv("MyfileName")
Files

    A    B
0  11  123
1  22  234
2  33  345
3  44  456
4  55  567

In [31]:
# Read AnyOne Single Row

row_read = pd.read_csv("MyfileName", nrows = 2)
row_read

    A    B
0  11  123
1  22  234

In [32]:
# Read AnyOne Column

col_read = pd.read_csv("MyfileName", usecols = ["A"])
col_read

    A
0  11
1  22
2  33
3  44
4  55

# Var = pd.read_csv("MyfileName", skiprows= [1,3,4,5]) =====> Used for skiped rows
# col_read = pd.read_csv("MyfileName", usecols = ["A","B","C"]) ====>  For Multiple Columns Read

# Convert column to index Column

In [33]:
DDT = pd.DataFrame({"A": [11,22,33,44,55], "B": [123,234,345,456,567], "C":[101,102,103,104,105]})
DDT.to_csv("ABC", index = False)
pd.read_csv("ABC", index_col = "A")

      B    C
A
11  123  101
22  234  102
33  345  103
44  456  104
55  567  105

# Create Header / Convert row to header

In [34]:
pd.read_csv('ABC', header = 2)

   22  234  102
0  33  345  103
1  44  456  104
2  55  567  105

# Find Index

In [35]:
DDT.index

RangeIndex(start=0, stop=5, step=1)

# Create New DataFrame

In [36]:
Dataf = pd.DataFrame({"Col_1": [123,345,678,987,432,123], "Col_2":[124,125,432,564,234,567], "Col_3": [456,765,234,908,103,405]})
Dataf

   Col_1  Col_2  Col_3
0    123    124    456
1    345    125    765
2    678    432    234
3    987    564    908
4    432    234    103
5    123    567    405

In [37]:
Dataf.to_csv("Dataf", index = False)

# Print All Column Name

In [38]:
Dataf.columns

Index(['Col_1', 'Col_2', 'Col_3'], dtype='object')

# Print First 5 Rows

In [39]:
Dataf.head(3)

   Col_1  Col_2  Col_3
0    123    124    456
1    345    125    765
2    678    432    234

# Print Last 5 Rows

In [40]:
Dataf.tail(3)

   Col_1  Col_2  Col_3
3    987    564    908
4    432    234    103
5    123    567    405

# Slicing in DataFrame

In [41]:
Dataf[0:3]

   Col_1  Col_2  Col_3
0    123    124    456
1    345    125    765
2    678    432    234

In [42]:
Dataf[:]

   Col_1  Col_2  Col_3
0    123    124    456
1    345    125    765
2    678    432    234
3    987    564    908
4    432    234    103
5    123    567    405

In [43]:
Dataf[:4]

   Col_1  Col_2  Col_3
0    123    124    456
1    345    125    765
2    678    432    234
3    987    564    908

# Data Covert into Numpy Array

In [44]:
Dataf.to_numpy()

array([[123, 124, 456],
       [345, 125, 765],
       [678, 432, 234],
       [987, 564, 908],
       [432, 234, 103],
       [123, 567, 405]], dtype=int64)

# Sort Data base on Index

In [45]:
Dataf.sort_index(axis= 1, ascending = False)

   Col_3  Col_2  Col_1
0    456    124    123
1    765    125    345
2    234    432    678
3    908    564    987
4    103    234    432
5    405    567    123

# Drop Column Name

# Drop Column

Dataf.drop("Column_Name", axis = 1)

# Drop Row Name

# Drop Row

Dataf.drop("Row_Name", axis = 0)

# Drop Unfill Column

In [46]:
# Create New Data Frame
# Inter null value in data

Dset = pd.DataFrame({"X": [123,np.nan,3,45,56,np.nan,432,134,13,], "Y":[123,6272,np.nan,882,829,np.nan,7389,np.nan,271], 
                      "Z": [12,34,45,67,23,354,56,23,2663]})
Dset

       X       Y     Z
0  123.0   123.0    12
1    NaN  6272.0    34
2    3.0     NaN    45
3   45.0   882.0    67
4   56.0   829.0    23
5    NaN     NaN   354
6  432.0  7389.0    56
7  134.0     NaN    23
8   13.0   271.0  2663

In [47]:
Dset.dropna()

# Atteributes
# axis = 1/0
# how = anyAll

       X       Y     Z
0  123.0   123.0    12
3   45.0   882.0    67
4   56.0   829.0    23
6  432.0  7389.0    56
8   13.0   271.0  2663

# Remove NaN Value along Column_Name

In [48]:
Dset.dropna(subset = ["X"])

       X       Y     Z
0  123.0   123.0    12
2    3.0     NaN    45
3   45.0   882.0    67
4   56.0   829.0    23
6  432.0  7389.0    56
7  134.0     NaN    23
8   13.0   271.0  2663

In [49]:
# Remove Row there have give integer null value>

Dset.dropna( thresh = 2)

       X       Y     Z
0  123.0   123.0    12
1    NaN  6272.0    34
2    3.0     NaN    45
3   45.0   882.0    67
4   56.0   829.0    23
6  432.0  7389.0    56
7  134.0     NaN    23
8   13.0   271.0  2663

# Fill Null Values

In [50]:
Dset.fillna("Mark")

       X       Y     Z
0  123.0   123.0    12
1   Mark  6272.0    34
2    3.0    Mark    45
3   45.0   882.0    67
4   56.0   829.0    23
5   Mark    Mark   354
6  432.0  7389.0    56
7  134.0    Mark    23
8   13.0   271.0  2663

In [51]:
# Fill Values base on the Columns.

Dset.fillna({"X": "Bittu", "Y": "Kumar", "Z": "VranVal"})

       X       Y     Z
0  123.0   123.0    12
1  Bittu  6272.0    34
2    3.0   Kumar    45
3   45.0   882.0    67
4   56.0   829.0    23
5  Bittu   Kumar   354
6  432.0  7389.0    56
7  134.0   Kumar    23
8   13.0   271.0  2663

In [52]:
# Forword Filling

Dset.ffill()

       X       Y     Z
0  123.0   123.0    12
1  123.0  6272.0    34
2    3.0  6272.0    45
3   45.0   882.0    67
4   56.0   829.0    23
5   56.0   829.0   354
6  432.0  7389.0    56
7  134.0  7389.0    23
8   13.0   271.0  2663

In [53]:
# Backword Filling

Dset.bfill()

       X       Y     Z
0  123.0   123.0    12
1    3.0  6272.0    34
2    3.0   882.0    45
3   45.0   882.0    67
4   56.0   829.0    23
5  432.0  7389.0   354
6  432.0  7389.0    56
7  134.0   271.0    23
8   13.0   271.0  2663

# Replace

In [54]:
Mark= pd.DataFrame({'A': [0, 1, 2, 3, 4],'B': [5, 6, 7, 8, 9],'C': ['a', 'b', 'c', 'd', 'e']})
Mark

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [55]:
Mark.replace(0, 500)

     A  B  C
0  500  5  a
1    1  6  b
2    2  7  c
3    3  8  d
4    4  9  e

In [56]:
Mark.replace([0, 1, 2, 3], 4000)

      A  B  C
0  4000  5  a
1  4000  6  b
2  4000  7  c
3  4000  8  d
4     4  9  e

In [57]:
Mark.replace([0, 1, 2, 3], [400, 300, 200, 100])

     A  B  C
0  400  5  a
1  300  6  b
2  200  7  c
3  100  8  d
4    4  9  e

# to_Replace Method

In [58]:
Mark.replace({0: 10, 1: 100})

     A  B  C
0   10  5  a
1  100  6  b
2    2  7  c
3    3  8  d
4    4  9  e

In [59]:
Mark.replace({'A': 0, 'B': 5}, 100)

     A    B  C
0  100  100  a
1    1    6  b
2    2    7  c
3    3    8  d
4    4    9  e

In [60]:
Mark.replace({'A': {0: 100, 4: 400}})

     A  B  C
0  100  5  a
1    1  6  b
2    2  7  c
3    3  8  d
4  400  9  e

# Interpolate Method

In [61]:
Mark = pd.DataFrame({"X": [123,np.nan,3,45,56,np.nan,432,134,13,], "Y":[123,6272,np.nan,882,829,np.nan,7389,np.nan,271], 
                     "Z": [12,34,45,67,23,354,56,23,2663]})

Mark

       X       Y     Z
0  123.0   123.0    12
1    NaN  6272.0    34
2    3.0     NaN    45
3   45.0   882.0    67
4   56.0   829.0    23
5    NaN     NaN   354
6  432.0  7389.0    56
7  134.0     NaN    23
8   13.0   271.0  2663

In [62]:
# Fill Null Values from random data.

Mark.interpolate()

       X       Y     Z
0  123.0   123.0    12
1   63.0  6272.0    34
2    3.0  3577.0    45
3   45.0   882.0    67
4   56.0   829.0    23
5  244.0  4109.0   354
6  432.0  7389.0    56
7  134.0  3830.0    23
8   13.0   271.0  2663

# Merge Data Frame

In [63]:
Var1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,22,33,44]})
Var2 = pd.DataFrame({"A": [1,2,3,4], "Y": [55,66,77,88]})

pd.merge(Var1, Var2, on = "A")

   A   B   Y
0  1  11  55
1  2  22  66
2  3  33  77
3  4  44  88

In [64]:
Var1 = pd.DataFrame({"A": [1,2,3,4], "B": [11,22,33,44]})
Var2 = pd.DataFrame({"A": [1,2,3,4], "Y": [55,66,77,88]})

pd.merge(Var1, Var2)

   A   B   Y
0  1  11  55
1  2  22  66
2  3  33  77
3  4  44  88

# ConCate Serise

In [65]:
# For Serise DataType

Sr1 = pd.Series([11,22,33,44,55])
Sr2 = pd.Series([1,2,3,4,5])

pd.concat([Sr1, Sr2])

0    11
1    22
2    33
3    44
4    55
0     1
1     2
2     3
3     4
4     5
dtype: int64

In [66]:
# ConCat DataFrame

In [67]:
D1 = pd.DataFrame({"A":[11,22,33,44,55], "B": [1,2,3,4,5]})
D2 = pd.DataFrame({"C":[11,22,33,44,55], "D": [1,2,3,4,5]})
pd.concat([D1, D2], axis = 1)

    A  B   C  D
0  11  1  11  1
1  22  2  22  2
2  33  3  33  3
3  44  4  44  4
4  55  5  55  5

In [68]:
pd.concat([D1, D2], axis = 0)

      A    B     C    D
0  11.0  1.0   NaN  NaN
1  22.0  2.0   NaN  NaN
2  33.0  3.0   NaN  NaN
3  44.0  4.0   NaN  NaN
4  55.0  5.0   NaN  NaN
0   NaN  NaN  11.0  1.0
1   NaN  NaN  22.0  2.0
2   NaN  NaN  33.0  3.0
3   NaN  NaN  44.0  4.0
4   NaN  NaN  55.0  5.0

# Join Method

In [69]:
DD1 = pd.DataFrame({"A":[11,22,33,44,55], "B": [1,2,3,4,5]})
DD2 = pd.DataFrame({"C":[11,22,33,44,55], "D": [1,2,3,4,5]})
DD1.join(DD2)

    A  B   C  D
0  11  1  11  1
1  22  2  22  2
2  33  3  33  3
3  44  4  44  4
4  55  5  55  5

# Append Method in DataFrame

DD1 = pd.DataFrame({"A":[11,22,33,44,55], "B": [1,2,3,4,5]})
DD2 = pd.DataFrame({"A":[11,22,33,44,55], "B": [1,2,3,4,5]})

Var = DD1.append(DD2)
print(Var)

# Count No. of Rows and Columns

In [70]:
pd.read_csv("ABC").shape

#Answer = (Rows, Columns)

(5, 3)

In [71]:
pd.read_csv("ABC").info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [72]:
pd.read_csv("ABC").describe()

# Work on Numerical data

               A          B           C
count   5.000000    5.00000    5.000000
mean   33.000000  345.00000  103.000000
std    17.392527  175.50641    1.581139
min    11.000000  123.00000  101.000000
25%    22.000000  234.00000  102.000000
50%    33.000000  345.00000  103.000000
75%    44.000000  456.00000  104.000000
max    55.000000  567.00000  105.000000

# Fetch Column Data

In [73]:
# For Single Columns

Xy = pd.read_csv("ABC")
Xy["B"]

0    123
1    234
2    345
3    456
4    567
Name: B, dtype: int64

In [74]:
# For Multiple Columns

Xy[["A","B"]]

    A    B
0  11  123
1  22  234
2  33  345
3  44  456
4  55  567

# Fetch Rows Data

In [75]:
Data = pd.read_csv("ABC")
Data

    A    B    C
0  11  123  101
1  22  234  102
2  33  345  103
3  44  456  104
4  55  567  105

In [76]:
Data.iloc[3]

A     44
B    456
C    104
Name: 3, dtype: int64

In [77]:
Data.iloc[1:3]

    A    B    C
1  22  234  102
2  33  345  103

In [78]:
Data.iloc[[1,3,4]]

    A    B    C
1  22  234  102
3  44  456  104
4  55  567  105

# Fatch Rows data as per given Condition

In [79]:
# Data Set

Data

    A    B    C
0  11  123  101
1  22  234  102
2  33  345  103
3  44  456  104
4  55  567  105

In [80]:
Mask = Data["B"] == 456
Data[Mask].shape

(1, 3)

In [81]:
Mask = Data["C"] == 105
Data[Mask].shape

(1, 3)

# Fatch data as per multiple given condition

In [82]:
mask1 = Data["A"] == 22
mask2 = Data["C"] ==102
print(Data[mask1 & mask2])

# AND Operater = &

    A    B    C
1  22  234  102

# Ceatogry Count

In [83]:
Data["A"].value_counts()

A
11    1
22    1
33    1
44    1
55    1
Name: count, dtype: int64

# Groups By Method

In [84]:
xyz = Data.groupby("B")
xyz

# Miscellaneous Functions

In [85]:
len(Data)

5

In [86]:
Data.shape

(5, 3)

In [87]:
Data.size

15

In [88]:
Data.first

<bound method NDFrame.first of     A    B    C
0  11  123  101
1  22  234  102
2  33  345  103
3  44  456  104
4  55  567  105>

In [89]:
Data.last
# More lear from the google about Last and First Function.
# Used feqr values in data frame.

<bound method NDFrame.last of     A    B    C
0  11  123  101
1  22  234  102
2  33  345  103
3  44  456  104
4  55  567  105>

In [90]:
Data.sum()

A     165
B    1725
C     515
dtype: int64

In [91]:
Data["B"].mean()

345.0

# Create Mask

In [92]:
mask = Data["B"] == 345
res = Data[mask]
mask

0    False
1    False
2     True
3    False
4    False
Name: B, dtype: bool

In [93]:
res

    A    B    C
2  33  345  103

# Rename Column Name

In [94]:
Data.rename(columns = {"A": "AA", "B":"BB"})

   AA   BB    C
0  11  123  101
1  22  234  102
2  33  345  103
3  44  456  104
4  55  567  105

# Set Index of DataFrame

In [95]:
# Convert data column to index column

Data.set_index("B")

      A    C
B
123  11  101
234  22  102
345  33  103
456  44  104
567  55  105

In [96]:
Data.reset_index()

   index   A    B    C
0      0  11  123  101
1      1  22  234  102
2      2  33  345  103
3      3  44  456  104
4      4  55  567  105

# Check Library Version

In [97]:
pd.__version__

'2.2.0'

In [98]:
np.__version__

'1.26.4'

# Print Table Data

In [99]:
# Syntax = Data.loc[Index]

print(Data.loc[4])
print(Data.loc[0])

A     55
B    567
C    105
Name: 4, dtype: int64
A     11
B    123
C    101
Name: 0, dtype: int64

In [100]:
print(Data.loc[1:3])

    A    B    C
1  22  234  102
2  33  345  103
3  44  456  104

# iloc() Functions

In [101]:
Data.iloc[0]

A     11
B    123
C    101
Name: 0, dtype: int64

In [102]:
Data.iloc[[1,3,2,0]]

    A    B    C
1  22  234  102
3  44  456  104
2  33  345  103
0  11  123  101

# Read Json

read = pd.read_json("FileName")
read.to_string()

# Remove Duplicates in DataSet

In [152]:
New = pd.DataFrame({"A": [1,2,13,4,13,22], "B":[22,34,33,22,304,33]})
csvf = New.to_csv("New.csv", index = False)
var = pd.read_csv("New.csv")
var

    A    B
0   1   22
1   2   34
2  13   33
3   4   22
4  13  304
5  22   33

In [153]:
# Check Duplicate VALUES
# Inter Column Name

yy = var.duplicated(["B"])
yy

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [155]:
# Use inplace = True/False

remov_dup = yy.drop_duplicates(inplace = False)
remov_dup

0    False
3     True
dtype: bool

In [150]:
var

    A    B
0   1   22
1   2   34
2  13   43
3   4   22
4  13  304
5  22   33

# Thank You